; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=4, packages=9, locations=11, density=0.8, fully_connected=False, max_capacity=2, out_folder=./dense/training, instance_id=54, seed=95

(define (problem transport-54)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c2)
    (capacity v3 c1)
    (capacity v4 c1)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l1)
    (at p2 l10)
    (at p3 l2)
    (at p4 l11)
    (at p5 l5)
    (at p6 l4)
    (at p7 l1)
    (at p8 l10)
    (at p9 l9)
    (at v1 l10)
    (at v2 l4)
    (at v3 l11)
    (at v4 l11)
    (road l4 l9)
    (road l11 l2)
    (road l8 l6)
    (road l2 l11)
    (road l6 l8)
    (road l4 l8)
    (road l8 l5)
    (road l9 l4)
    (road l10 l11)
    (road l11 l10)
    (road l1 l8)
    (road l3 l11)
    (road l4 l10)
    (road l8 l4)
    (road l8 l1)
    (road l8 l7)
    (road l10 l4)
    (road l5 l8)
    (road l11 l3)
    (road l7 l8)
    (road l6 l9)
    (road l9 l6)
    (road l5 l11)
    (road l11 l5)
    (road l5 l7)
    (road l7 l5)
    (road l3 l4)
    (road l4 l3)
    (road l1 l11)
    (road l11 l1)
    (road l9 l10)
    (road l10 l9)
    (road l6 l11)
    (road l11 l6)
    (road l2 l8)
    (road l8 l2)
    (road l8 l9)
    (road l9 l8)
    (road l2 l3)
    (road l3 l2)
    (road l4 l7)
    (road l7 l4)
    (road l6 l10)
    (road l10 l6)
    (road l2 l7)
    (road l7 l2)
    (road l2 l4)
    (road l4 l2)
    (road l2 l5)
    (road l5 l2)
    (road l3 l8)
    (road l8 l3)
    (road l1 l7)
    (road l7 l1)
    (road l2 l9)
    (road l9 l2)
    (road l2 l10)
    (road l10 l2)
    (road l1 l10)
    (road l10 l1)
    (road l7 l9)
    (road l9 l7)
    (road l3 l7)
    (road l7 l3)
    (road l1 l9)
    (road l9 l1)
    (road l5 l10)
    (road l10 l5)
    (road l9 l11)
    (road l11 l9)
    (road l3 l5)
    (road l5 l3)
    (road l1 l4)
    (road l4 l1)
    (road l4 l6)
    (road l6 l4)
    (road l1 l6)
    (road l6 l1)
    (road l5 l6)
    (road l6 l5)
    (road l1 l5)
    (road l5 l1)
    (road l4 l5)
    (road l5 l4)
    (road l4 l11)
    (road l11 l4)
    (road l2 l6)
    (road l6 l2)
    )
 (:goal  (and 
    (at p1 l9)
    (at p2 l4)
    (at p3 l5)
    (at p4 l3)
    (at p5 l4)
    (at p6 l2)
    (at p7 l3)
    (at p8 l9)
    (at p9 l10))))

; plan
1. (pick-up v2 l4 p6 c1 c2)
   deleted: (at p6 l4) (capacity v2 c2)
   added: (in p6 v2) (capacity v2 c1)
   goals met: 0 of 9
2. (drive v2 l4 l2)
   deleted: (at v2 l4)
   added: (at v2 l2)
   goals met: 0 of 9
3. (pick-up v2 l2 p3 c0 c1)
   deleted: (at p3 l2) (capacity v2 c1)
   added: (in p3 v2) (capacity v2 c0)
   goals met: 0 of 9
4. (drop v2 l2 p6 c0 c1)
   deleted: (in p6 v2) (capacity v2 c0)
   added: (at p6 l2) (capacity v2 c1)
   goals met: 1 of 9
5. (drive v2 l2 l5)
   deleted: (at v2 l2)
   added: (at v2 l5)
   goals met: 1 of 9
6. (drop v2 l5 p3 c1 c2)
   deleted: (in p3 v2) (capacity v2 c1)
   added: (at p3 l5) (capacity v2 c2)
   goals met: 2 of 9
7. (pick-up v2 l5 p5 c1 c2)
   deleted: (at p5 l5) (capacity v2 c2)
   added: (in p5 v2) (capacity v2 c1)
   goals met: 2 of 9
8. (drive v2 l5 l4)
   deleted: (at v2 l5)
   added: (at v2 l4)
   goals met: 2 of 9
9. (drop v2 l4 p5 c1 c2)
   deleted: (in p5 v2) (capacity v2 c1)
   added: (at p5 l4) (capacity v2 c2)
   goals met: 3 of 9
10. (drive v2 l4 l1)
   deleted: (at v2 l4)
   added: (at v2 l1)
   goals met: 3 of 9
11. (pick-up v2 l1 p1 c1 c2)
   deleted: (at p1 l1) (capacity v2 c2)
   added: (in p1 v2) (capacity v2 c1)
   goals met: 3 of 9
12. (pick-up v2 l1 p7 c0 c1)
   deleted: (at p7 l1) (capacity v2 c1)
   added: (in p7 v2) (capacity v2 c0)
   goals met: 3 of 9
13. (drive v2 l1 l9)
   deleted: (at v2 l1)
   added: (at v2 l9)
   goals met: 3 of 9
14. (drop v2 l9 p1 c0 c1)
   deleted: (in p1 v2) (capacity v2 c0)
   added: (at p1 l9) (capacity v2 c1)
   goals met: 4 of 9
15. (pick-up v2 l9 p9 c0 c1)
   deleted: (at p9 l9) (capacity v2 c1)
   added: (in p9 v2) (capacity v2 c0)
   goals met: 4 of 9
16. (drive v2 l9 l10)
   deleted: (at v2 l9)
   added: (at v2 l10)
   goals met: 4 of 9
17. (drop v2 l10 p9 c0 c1)
   deleted: (in p9 v2) (capacity v2 c0)
   added: (at p9 l10) (capacity v2 c1)
   goals met: 5 of 9
18. (pick-up v1 l10 p8 c0 c1)
   deleted: (at p8 l10) (capacity v1 c1)
   added: (in p8 v1) (capacity v1 c0)
   goals met: 5 of 9
19. (drive v1 l10 l9)
   deleted: (at v1 l10)
   added: (at v1 l9)
   goals met: 5 of 9
20. (drop v1 l9 p8 c0 c1)
   deleted: (in p8 v1) (capacity v1 c0)
   added: (at p8 l9) (capacity v1 c1)
   goals met: 6 of 9
21. (pick-up v4 l11 p4 c0 c1)
   deleted: (at p4 l11) (capacity v4 c1)
   added: (in p4 v4) (capacity v4 c0)
   goals met: 6 of 9
22. (drive v4 l11 l3)
   deleted: (at v4 l11)
   added: (at v4 l3)
   goals met: 6 of 9
23. (drop v4 l3 p4 c0 c1)
   deleted: (in p4 v4) (capacity v4 c0)
   added: (at p4 l3) (capacity v4 c1)
   goals met: 7 of 9
24. (pick-up v2 l10 p2 c0 c1)
   deleted: (at p2 l10) (capacity v2 c1)
   added: (in p2 v2) (capacity v2 c0)
   goals met: 7 of 9
25. (drive v2 l10 l4)
   deleted: (at v2 l10)
   added: (at v2 l4)
   goals met: 7 of 9
26. (drop v2 l4 p2 c0 c1)
   deleted: (in p2 v2) (capacity v2 c0)
   added: (at p2 l4) (capacity v2 c1)
   goals met: 8 of 9
27. (drive v2 l4 l3)
   deleted: (at v2 l4)
   added: (at v2 l3)
   goals met: 8 of 9
28. (drop v2 l3 p7 c1 c2)
   deleted: (in p7 v2) (capacity v2 c1)
   added: (at p7 l3) (capacity v2 c2)
   goals met: 9 of 9
